load.yml
config:
  target: 'http://ec2-34-205-45-183.compute-1.amazonaws.com'
  http:
    # Responses have to be sent within 300 seconds or the request will be aborted
    timeout: 300
    pool: 10 # All HTTP requests from all virtual users will be sent over the same 10 connections
  phases:
    - duration: 100
      arrivalRate: 5
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - flow:
    - get:
        url: '/api/genes/'
        headers:
          Content-Type: 'application/json'